import Box from '@mui/material/Box';
import Typography from '@mui/material/Typography';

import "./requirement.css"

function RequirementPage() {

    return (
        <Box id="frame-outline-RequirementPage">
            <Box id="topic-requirementPage">
                <Typography id="topic-in-requirementPage">
                    ระบบหลัก ระบบแจ้งซ่อมคอมพิวเตอร์
                </Typography>    
            </Box>
            <Box id="system-box-requirement">
                <Typography id="text-in-requirementPage">
                    ระบบย่อย ระบบจัดการข้อมูลการแจ้งซ่อม
                    <p> 
                    เป็นระบบที่ user ซึ่งเป็นลูกค้าต้องล็อคอินเข้ามาในระบบจะใช้ข้อมูลจาก
                    ข้อมูลการลงข้อมูล ในส่วนต่างๆที่ต้องการอย่าง การบันทึกข้อมูลที่จำเป็นเพื่อใช้ในการแจ้งซ่อมอย่าง อาการหรือ
                    สภาพความเสียหายของคอมพิวเตอร์ที่ต้องการมาซ่อมในขณะนั้น เลือกวันที่ต้องการให้มาซ่อม วันที่แสดงอาการ
                    การเลือกระดับเรทราคาที่พร้อมจ่ายในการซ่อมนั้น โดยข้อมูลดังกล่าวจะโยงข้อมูลของ สมาชิกที่ทำการออเดอร์
                    เพื่อเป็นข้อมูลที่ต้องใช้ต่อในอนาคต ที่จำเป็นต้องใช้ต่อไป
                    </p>
                </Typography>
            </Box>
            <Box id="system-box-requirement">
                <Typography id="text-in-requirementPage">
                    ระบบย่อย ระบบยกเลิกการแจ้งซ่อม
                    <p> 
                    เป็นระบบที่user ซึ่งเป็นลูกค้าต้องล็อคอินเข้ามาในระบบจะใช้ข้อมูลจาก
                    จัดการข้อมูลการแจ้งซ่อม นำมาแยกระบบ เพื่อที่ให้การยกเลิกออเดอร์มีความรัดกุมที่สุด เนื่องจากการยกเลิกออ
                    เดอร์มีผลทำให้เกิดการสูญเสียรายได้ จึงต้องมีการเก็บข้อมูลเพื่อที่จะนำไปใช้ปรับปรุงในอนาคต โดยหลักๆจะมี
                    การเก็บข้อมูลอย่าง No.ของออเดอร์ที่ต้องการยกเลิก ช่วงเวลาที่ยกเลิก เหตุผลที่ยกเลิกออเดอร์ช่องทางการคืน
                    เงิน และต้องมีปุ่ม Confirm เพื่อให้สมาชิกแน่ใจว่าต้องการยกเลิกออเดอร์โดยส่วนนี้จะโยงข้อมูลมาจาก ระบบ
                    บันทึกการลงข้อมูลการแจ้งซ่อม ที่สมาชิกต้องเป็นคนยกเลิกด้วยตนเอง ข้อมูลทั้งหมดที่นำมา จะนำไปเป็นข้อมูล
                    ในการปรับปรุงการทำงานให้ดียิ่งขึ้น
                    </p>
                </Typography>
            </Box>
            <Box id="system-box-requirement">
                <Typography id="text-in-requirementPage">
                    ระบบย่อย ระบบประเมินความพึงพอใจ
                    <p> 
                    เป็นระบบที่ให้ผู้ใช้ระบบซึ่งสมาชิกระบบแจ้งซ่อม
                    คอมพิวเตอร์สามารถ login เข้าระบบเพื่อบันทึกแก้ไข ลบ และแสดงผลการประเมินความ
                    พึงพอใจ หลังจากทำการซ่อมคอมพิวเตอร์เสร็จแล้วว่าลูกค้ามีความพึงพอใจมากน้อย
                    เพียงใดในการใช้บริการระบบ และการให้บริการของช่างเพื่อผู้ให้บริการระบบและช่างผู้
                    ให้บริการซ่อม เพื่อปรับปรุงแก้ไขการให้บริการซ่อมคอมพิวเตอร์ให้ดียิ่งขึ้น
                    </p>
                </Typography>
            </Box>
            <Box id="system-box-requirement">
                <Typography id="text-in-requirementPage">
                    ระบบย่อย ระบบรายงานปัญหาหลังการซ่อม
                    <p> 
                    เป็นระบบที่ให้ผู้ใช้ระบบซึ่งสมาชิกระบบแจ้งซ่อม
                    คอมพิวเตอร์สามารถ login เข้าระบบ เพื่อทำการแจ้งปญหาหากพบว่า คอมพิวเตอร์ที่
                    ทำการซ่อมเสร็จแล้วเกิดปัญหาและอยู่ในระยะเวลารับประกันของทางแพลตฟอร์ม จะ
                    สามารถรายงานปัญหาที่เกิดขึ้นหลังจากการซ่อมเพื่อให้ระบบส่งช่างเข้ามาแก้ไขปัญหาที่
                    เกิดขึ้น และแสดงผลสิ่งที่รายงานไปแล้วได้ด้วย
                    </p>
                </Typography>
            </Box>
            <Box id="system-box-requirement">
                <Typography id="text-in-requirementPage">
                    ระบบย่อย ระบบชำระเงิน
                    <p> 
                    เป็นระบบที่ผู้ใช้งานที่เข้าสู่ระบบในฐานะของ ลูกค้า โดยผู้ใช้งานสามารถดูค่าใช้จ่ายที่
                    ต้องชำระพร้อมทั้งช่องทางการชำระเงิน เมื่อลูกค้าทำการโอนเงินเสร็จสิ้น ลูกค้าจะบันทึกข้อมูลการโอนเงิน ซึ่ง
                    ประกอบไปด้วย(หมายเลขการทำรายการ,ชื่อผู้โอน,ธนาคารที่โอนเข้า,จำนวนเงินที่โอน,วันเวลาที่โอน) และยัง
                    สามารถแก้ไขหรือลบข้อมูลการชำระเงินได้ เพื่อให้ admin ทำการตรวจสอบความถูกต้องของข้อมูลการชำระ
                    เงินต่อไป จะได้ข้อมูลของการชำระเงิน เพื่อนำไปตรวจสอบต่อไป
                    </p>
                </Typography>
            </Box>
            <Box id="system-box-requirement">
                <Typography id="text-in-requirementPage">
                    ระบบย่อย ระบบตรวจสอบการชำระเงิน
                    <p> 
                    เป็นระบบที่ผูใช้งานเข้าสู่ระบบในฐานะของ admin สามารถ ดูรายการ
                    ทั้งหมดที่ลูกค้าแจ้งชำระไว้ได้ สามารถเลือกข้อมูลการชำระเงินเพื่อทำการตรวจสอบได้ เมื่อ admin
                    ตรวจสอบเสร็จสิ้น admin จะกำหนดสถานะการตรวจสอบการชำระเงินของลูกค้าและทำการบันทึกเข้าสู่
                    ระบบ admin สามารถแก้ไข,ลบหรือแสดงข้อมูลการตรวจสอบได้ ส่งผลให้ได้ข้อมูลการชำระเงินที่มีการ
                    ตรวจสอบแล้วของลูกค้า ออกมา 
                    </p>
                </Typography>
            </Box>
            <Box id="system-box-requirement">
                <Typography id="text-in-requirementPage">
                    ระบบย่อย ระบบรับออร์เดอร์ช่าง
                    <p> 
                    เป็นระบบที่ให้ช่างที่เป็นสมาชิกช่างของระบบแจ้งซ่อมคอมพิวเตอร์
                    สามารถ login เข้าสู่ระบบ และกดสู่หน้ารับออเดอร์ช่าง เพื่อดูออเดอร์ของลูกค้าได้โดยจะมีแบบ public
                    และ private ในส่วนของ public จะแสดงออเดอร์ลูกค้าทั้งหมดที่มีสถานะ READY
                    ส่วน private จะแสดงในส่วนของที่ช่างได้รับออเดอร์ เข้ามาแล้วและมีสถานะเป็น กำลังดำเนินการ
                    และเปลี่ยนจาก READY เป็น PROCESS
                    </p>
                </Typography>
            </Box>
            <Box id="system-box-requirement">
                <Typography id="text-in-requirementPage">
                    ระบบย่อย ระบบบันทึกค่าใช้จ่ายของช่าง
                    <p> 
                    เป็นระบบที่ให้ช่างที่เป็นสมาชิกช่างของระบบแจ้งซ่อมคอมพิวเตอร์
                    สามารถ login เข้าสู่ระบบ และกดสู่หน้ารับออเดอร์ช่าง เพื่อดูออเดอร์ของช่างได้โดยจะมีแบบ public
                    และ private ในส่วนของ public จะแสดงออเดอร์ลูกค้าทั้งหมดที่มีสถานะ ดำเนินการเสร็จสิ้น
                    และเป็นของช่างที่เข้าระบบเท่านั้น ส่วน private จะแสดงในส่วนของที่ช่างได้บันทึกค่าใช้จ่ายเข้ามาแล้ว
                    สามารถกด เลือก ออเดอร์ของช่างได้ จะนำไปสู่หน้าถัดไปคือ ระบบรับออเดอร์ช่างที่จะมีรายละเอียด
                    ของออเดอร์ช่างที่กรอกจากระบบรับออเดอร์ช่าง และช่างจะต้องกรอกหรือเลือก Order Tech
                    เพื่อระบุตัวลูกค้า และช่างต้องกรอก hardware or Software จำนวน และ ราคา เมื่อกรอกและเลือกเสร็จ
                    แล้วจะต้อง add เพื่อบันทึกรายละเอียดของต่างๆลงไปและจะแสดงในหน้านั้นๆเลย display
                    จะแสดงเฉพาะ Order Tech นั้นๆแล้วสามารถกด back และ confirm ได้เมื่อกด back
                    แล้วสามารถดู display มีออเดอร์ private ของช่าง มีอะไรบ้าง และสามารถกด แก้ไข และ ลบได้ที่หน้านี้
                    เพื่อไปยังหน้า อัพเดต ในส่วนของปุ่ม confirm จะเป็นการสร้างรายการบันทึกไปที่ระบบชำระเงิน
                    ซึ่งจะเปลี่ยนสถานะเป็น Finish และ ForPayment 
                    </p>
                </Typography>
            </Box>
            <Box id="system-box-requirement">
                <Typography id="text-in-requirementPage">
                    ระบบย่อย ระบบสมาชิกแจ้งซ่อม
                    <p> 
                    ระบบสมาชิกแจ้งซ่อม เป็นระบบที่ให้ลูกค้าใช้ซึ่งหากลูกค้ายังไม่เป็นสมาชิกสามารถ สมัครสมาชิก(Sign-in)ได้ 
                    ซึ่งการสมัครสมาชิกจะมีการเก็บข้อมูลต่างๆของลูกค้าเช่น คำนำหน้าชื่อ, เลขบัตรประชาชน, ชื่อ, เพศ, เบอร์โทร, อาชีพ, 
                    เพื่อให้ได้ข้อมูลในการระบุตัวตนของลูกค้าในการเข้าใช้งานระบบต่างๆในระบบแจ้งซ่อมคอมพิวเตอร์ได้ 
                    </p>
                </Typography>
            </Box>
            <Box id="system-box-requirement">
                <Typography id="text-in-requirementPage">
                    ระบบย่อย ระบบช่าง
                    <p> 
                    เป็นระบบที่จะต้องให้ผู้ดูแลระบบไปหาช่างมาก่อนแล้วเพิ่มช่างเข้ามาในระบบ
                    ซึ่งระบบนี้จะให้ช่างเป็นผู้ใช้งาน ช่างจะต้องลงชื่อเข้าใช้งานก่อน แล้วจะสามารถแก้ไขข้อมูลของตนเองได้ 
                    นั่นหมายความว่าช่างจะต้องสามารถดูข้อมูลที่ ระบบมีการกรอกข้อมูลส่วนต่างๆเช่น ID, ชื่อ, เพศ, เบอร์โทร, ที่อยู่ของช่าง, ระดับการศึกษา, คำนำหน้าชื่อ 
                    มาจากผู้ดูแลระบบก่อนแล้ว และช่างสามารถเข้ามาแก้ไขข้อมูลส่วนนี้ได้ ทำให้ได้ข้อมูลช่างที่ใหม่เสมอเก็บไว้ในฐานข้อมูลของระบบ 
                    </p>
                </Typography>
            </Box>
            <Box id="system-box-requirement">
                <Typography id="text-in-requirementPage">
                    ระบบย่อย ระบบที่อยู่ผู้แจ้ง
                    <p> 
                    เป็นระบบที่ให้ลูกค้าซึ่งเป็นสมาชิกของระบบแจ้งซ่อมคอมพิวเตอร์สามารถ Login 
                    เข้ามาใช้งานได้ โดยทางระบบจะสามารถทำการบันทึกข้อมูลที่อยู่ผู้แจ้ง แก้ไขข้อมูลที่อยู่ผู้แจ้ง ลบข้อมูลที่อยู่ผู้
                    แจ้ง และ แสดงข้อมูลที่อยู่ผู้แจ้งได้ ระบบจะทำการเก็บข้อมูลต่างๆ ของลูกค้า เช่น  บ้านเลขที่ หมู่บ้าน ตำบล 
                    อำเภอ จังหวัด รหัสไปรษณีย์ เป็นต้น
                    </p>
                </Typography>
            </Box>
            <Box id="system-box-requirement">
                <Typography id="text-in-requirementPage">
                    ระบบย่อย ระบบอุปกรณ์ผู้แจ้ง
                    <p> 
                    เป็นระบบที่ให้ลูกค้าซึ่งเป็นสมาชิกของระบบแจ้งซ่อมคอมพิวเตอร์สามารถ 
                    Login เข้ามาใช้งานได้ โดยทางระบบจะสามารถทำการบันทึกข้อมูลอุปกรณ์ผู้แจ้ง แก้ไขข้อมูลอุปกรณ์ผู้แจ้ง 
                    ลบข้อมูลอุปกรณ์ผู้แจ้ง และ แสดงข้อมูลอุปกรณ์ผู้แจ้งได้ ระบบจะทำการเก็บข้อมูลอุปกรณ์ต่างๆของลูกค้า 
                    เช่น ประเภทของอุปกรณ์ ระบบปฎิบัติการ Monitor CPU GPU RAM Harddisk เป็นต้น
                    </p>
                </Typography>
            </Box>
        </Box>
    )
}

export default RequirementPage